<template lang="html">
  <b-container class="pastor">
    <b-row class="justify-content-around">
      <b-col cols="12" lg="4" data-aos="fade-right">
        <img class="pastor-img" src="../assets/img/pastor.png">
      </b-col>
      <b-col cols="12" lg="6" data-aos="fade-left">
        <p class="pastor-article">Отчий дом — это христианская протестантская церковь. Церковь была основана в 2006 году Александром Хомяковым, который и по сей день является старшим пастором церкви. Отчий дом начинался с 30 человек и собраний в арендованном помещении. В 2018 году церковь переехала в свое собственное здание, и сегодня ее посещают порядка 600 человек.</p>
          <p>Александр Хомяков — пастор церкви, рукоположенный на это служение в 1993 году, еще до появления Отчего дома.</p>
          <p>Вся семья пастора — служители: жена и две дочери служат в группе прославления, а сын является молодежным лидером. Александр Хомяков — любящий пастор, посвятивший большую часть своей жизни Богу и созданию поместной церкви, миссия которой — приближение людей к Иисусу.</p>
      </b-col>
    </b-row>
  </b-container>
</template>

<script>
export default {
}
</script>

<style lang="scss" scoped>
@import '../assets/scss/main.scss';
.pastor {
  padding: 6rem 0rem;
}
.pastor-img {
  width: 100%;
}
</style>
